<template>
    <div id="contract-cnt">
        <div class="contract-main">
            <div class="bread-crumb"><span @click="$router.push({path:'/index'})">首页</span> > <span>{{names}}</span></div>
            <div class="contract-box">
               <div id="nav-column" class="nav-column nav-column-abs">
                   <span class="nav-column-title pull-block">帮助中心</span>
                   <div class="nav-column-text">
                       <span v-for="(item,index) in contractData" :key="index" :class="item.className" @click="btnscroll(item,index)">{{item.name}}</span>
                   </div>
               </div>
               <div class="cnt-column">
                   <h2 class="cnt-column-title pull-block">{{contractTitle}}</h2>
                   <div class="cnt-column-text cnt-column-text-One" v-if="contractNames=='contractOne'">
                      <section>
                        <p>"欢迎“您”（以下或称“用户”）与“深圳市大富科技股份有限公司”（下称“大富智造云”）共同签署本《大富智造云服务条款》协议（下称“本协议”），本协议阐述之条款和条件适用于您使用大富智造云中国站所提供的在全球企业间中进行贸易和交流的各种工具和服务(下称“服务”)（所涉域名为 ：tatfookcloud.com、tatfookol.com，下同）</p>  
                      </section>
                      <section>
                          <h3>一、接受协议条款</h3>
                          <p>
                              <span>1.1 本协议内容包括协议正文及附件及所有大富智造云已经发布或将来可能发布的各类规则。所有附件及规则为本协议不可分割的一部分，与本协议正文具有同等法律效力。</span>
                              <span>1.2 以任何方式进入大富智造云中国站并使用服务即表示您已充分阅读、理解并同意接受本协议的条款和条件。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，您应立即停止注册程序并停止使用服务。</span>
                              <span>1.3大富智造云有权根据业务需要修订“条款”，并以网站公告的形式进行更新。经修订的“条款”一经在大富智造云中国站公布，即产生效力。如您不同意相关修订，请您立即停止使用“服务”。如您继续使用“服务”，则将视为您已接受经修订的“条款”，当您与大富智造云发生争议时，应以最新的“条款”为准。</span>
                          </p>
                      </section>
                      <section>
                          <h3>二、账户注册和使用</h3>
                          <p>
                              <span>2.1 服务对象</span>
                              <span>您确认，在您完成注册程序或以其他大富智造云平台允许的方式实际使用服务时，您应当是具备完全民事权利能力和与所从事的民事行为相适应的行为能力的自然人、法人或其他组织。若您不具备前述主体资格，请勿使用服务，否则您及您的监护人应承担因此而导致的一切后果，且大富智造云有权注销或永久冻结您的账户，并向您及您的监护人索偿。如您代表一家公司或其他法律主体在大富智造云中国站登记，则您应声明和保证您有权使该公司或该法律主体受本协议的约束。</span>
                          </p>
                          <p>
                              <span>2.2 账户注册</span>
                              <span>
                                  2.2.1 在您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或在您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后， 或您以其他大富智造云平台允许的方式实际使用大富智造云中国站服务时，您即受本协议的约束。您可以使用您提供或确认的邮箱、手机号码或者大富智造云允许的其它方式作为登录手段进入大富智造云中国站。
                              </span>
                              <span>
                                  2.2.2 您可以对账户设置用户名，但您设置的用户名不得侵犯他人合法权益。如您设置的用户名可能侵犯他人合法权益，大富智造云有权终止向您提供服务，并注销您的账户。账户注销后，相应的用户名将开放给其他有权用户登记使用。
                              </span>
                              <span>
                                  2.2.3 在完成注册、激活、认证流程时，您应当按照法律法规要求，按相应页面的提示准确提供并及时更新您的资料，以使之真实、及时，完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，大富智造云有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部大富智造云服务，大富智造云对此不承担任何责任，您将承担因此产生的任何直接或间接损失及不利后果。
                              </span>
                          </p>
                            <p>
                              <span>2.3实名认证</span>
                              <span>为使您更好地使用大富智造云中国站的各项服务，保障您的账户安全，大富智造云可要求您按国家法律法规的规定完成实名认证。</span>
                          </p>
                            <p>
                              <span>2.4账户安全 </span>
                              <span>您须自行负责对您的登录名、用户名和密码保密，且须对该登录名、用户名和密码下发生的所有活动（包括但不限于信息披露、发布信息、网上点击同意或提交各类规则协议、网上续签协议或购买服务等）承担责任。您同意：(a)如发现任何人未经授权使用您的登录名、用户名和密码，或发生违反保密规定的任何其他情况，您会立即通知大富智造云，并授权大富智造云采取必要处理行动；及(b)确保您在每个上网时段结束时，以正确步骤离开网站。大富智造云不能也不会对因您未能遵守本款规定而发生的任何损失或损毁负责。您理解大富智造云对您的请求采取行动需要合理时间，大富智造云对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。除非有法律规定或司法裁定，或预先征得大富智造云的同意，否则，您登录名、用户名和密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。</span>
                          </p>
                            <p>
                              <span>2.5 隐私</span>
                              <span>大富智造云承诺保护您的隐私，为此大富智造云还将根据大富智造云的隐私声明使用"您的资料"。大富智造云隐私声明的全部条款属于本协议的一部份，因此，您必须仔细阅读。请注意，您一旦自愿地在大富智造云交易地点披露"您的资料"，该等资料即可能被其他人士获取和使用。 </span>
                          </p>
                      </section>
                      <section>
                          <h3>三、服务及使用规范 </h3>
                          <p>
                              <span>您有权在大富智造云中国站上享受企业或个人展示页面管理、产品及/或服务的报价、销售与推广、产品及/或服务的询价、采购与评价、交易争议处理等服务。大富智造云提供的服务内容众多，具体您可登录大富智造云中国站浏览。</span>
                          </p>
                          <p>
                              <span>3.1关于您的资料的规则</span>
                              <span>
                                  3.1.1“您的资料”包括您在注册、发布信息或交易等过程中、在任何公开信息场合或通过任何电子形式，向大富智造云或其他用户提供的任何资料 ，包括数据、文本、软件、图纸、照片、图画、影像、词句或其他材料。您应对“您的资料”负全部责任，而大富智造云仅作为您在网上发布和刊登“您的资料”的被动渠道。
                              </span>
                              <span>
                                  3.1.2 您同意并承诺，“您的资料”和您供在大富智造云网站上交易的任何“物品”（泛指一切可供依法交易的、有形的或无形的、以各种形态存在的某种具体的物品，或某种权利或利益，或某种票据或证券，或某种服务或行为。本协议中“物品”一词均含此义）: 
                              </span>
                              <span class="active-index">
                                 a.不会有欺诈成份，与售卖伪造或盗窃无涉； 
                              </span>
                              <span class="active-index">b.不会侵犯任何第三者对该物品享有的物权，或版权、专利、商标、商业秘密或其他知识产权，或隐私权、名誉权；</span>
                              <span class="active-index">c.不会违反任何法律、法规、条例或规章(包括但不限于关于规范出口管理、凭许可证经营、贸易配额、保护消费者、不正当竞争或虚假广告的法律、法规、条例或规章)、本协议及相关规则； </span>
                              <span class="active-index">d.不会含有诽谤（包括商业诽谤）、非法恐吓或非法骚扰的内容； </span>
                              <span class="active-index">e.不会含有淫秽、或包含任何儿童色情内容； </span>
                              <span class="active-index">f.不会含有蓄意毁坏、恶意干扰、秘密地截取或侵占任何系统、数据或个人资料的任何病毒、伪装破坏程序、电脑蠕虫、定时程序炸弹或 其他电脑程序；</span>
                              <span class="active-index">g.不会直接或间接与下述各项货物或服务连接，或包含对下述各项货物或服务的描述：(i)本协议项下禁止的货物或服务；或(ii)您无权连接或包含的货物或服务。此外，您同意不会：（ⅲ）在与任何连锁信件、大量胡乱邮寄的电子邮件、滥发电子邮件或任何复制或多余的信息有关的方面使用“服务”；(ⅳ)未经他人同意，利用“服务”收集其他人的电子邮件地址及其他资料；或（ⅴ）利用“服务”制作虚假的电子邮件地址，或以其他形式试图在发送人的身份或信息的来源方面误导其他人士； </span>
                              <span class="active-index">h. 不含有大富智造云认为应禁止或不适合通过大富智造云网站宣传或交易的内容。</span>
                              <span>3.1.3 您同意，您不会对任何资料作商业性利用，包括但不限于在未经大富智造云事先书面批准的情况下，复制在大富智造云网站上展示的任何资料并用于商业用途。 </span>
                          </p>
                          <p>
                              <span>3.2 关于交易的规则</span>
                              <span>3.2.1 添加物品描述条目。物品描述是由您提供的在大富智造云网站上展示的文字描述、图画和/或照片，可以是(a)对您拥有而您希望出售的物品的描述；或(b)对您正寻找的物品的描述。您须将该等物品描述归入正确的类目内。大富智造云不对物品描述的准确性或内容负责。 </span>
                              <span>3.2.2 就交易进行协商。交易各方通过在大富智造云网站及所属沟通工具进行相互协商，明确描述报盘和回盘（即下达订单）。所有各方接纳协商结果将使所涉及的大富智造云用户有义务完成交易。除非在特殊情况下，诸如用户在您提出报盘后实质性地更改对物品的描述或澄清任何文字输入错误，或您未能证实交易所涉及的用户的身份等，报盘和承诺均不得撤回。</span>
                              <span>3.2.3 不得操纵交易。您同意不利用帮助实现蒙蔽或欺骗意图的同伙(下属的客户或第三方)，操纵与另一交易方所进行的商业谈判的结果。 </span>
                              <span>3.2.4 不得干扰交易系统。您同意，您不得使用任何装置、软件或例行程序干预或试图干预大富智造云中国站的正常运作或正在大富智造云网站上进行的任何交易。您不得采取对任何将不合理或不合比例的庞大负载加诸大富智造云网络结构的行动。</span>
                              <span>3.2.5 关于交易反馈。您不得采取任何可能损害信息反馈系统的完整性的行动，诸如利用第二会员身份标识或第三者为您本身留下正面反馈；利用第二会员身份标识或第三者为其他用户留下负面反馈(反馈数据轰炸)；或在用户未能履行交易范围以外的某些行动时，留下负面的反馈(反馈恶意强加)。 </span>
                              <span>3.2.6 关于处理交易争议。</span>
                              <span>(i) 大富智造云不涉及用户间因交易而产生的法律关系及法律纠纷。倘若您与一名或一名以上用户，或与您通过大富智造云网站获取其服务的第三者服务供应商发生争议，您同意免除大富智造云(及大富智造云代理人和雇员)在因该等争议而引起的，或在任何方面与该等争议有关的不同种类和性质的任何(实际和后果性的)权利主张、要求和损害赔偿等方面的责任。 </span>
                              <span>(ii) 大富智造云有权受理并调处您与其他用户因交易产生的争议，同时有权单方面独立判断其他用户对您的投诉及(或)索偿是否成立，若大富智造云判断索偿成立，则您应及时使用自有资金进行偿付，否则大富智造云有权使用您交纳的保证金（如有）或扣减已购大富智造云及其关联公司的产品或服务中未履行部分的费用或您在大富智造云网站所有账户下的其他资金(或权益)等进行相应偿付。大富智造云没有使用自用资金进行偿付的义务，但若进行了该等支付，您应及时赔偿大富智造云的全部损失，否则大富智造云有权通过前述方式抵减相应资金或权益，如仍无法弥补大富智造云损失，则大富智造云保留继续追偿的权利。因大富智造云非司法机构，您完全理解并承认，大富智造云对证据的鉴别能力及对纠纷的处理能力有限，受理贸易争议完全是基于您委托，不保证争议处理结果符合您的期望，亦不对争议处理结果承担任何责任。大富智造云有权决定是否参与争议的调处。 </span>
                              <span>(iii) 大富智造云有权通过电子邮件等联系方式向您了解情况，并将所了解的情况通过电子邮件等方式通知对方，您有义务配合大富智造云的工作，否则大富智造云有权做出对您不利的处理结果。</span>
                          </p>
                          <p>
                              <span>3.3 违反规则结果</span>
                              <span>3.3.1 倘若大富智造云认为“您的资料”可能使大富智造云承担任何法律或道义上的责任，或可能使大富智造云(全部或部分地)失去大富智造云的互联网服务供应商或其他供应商的服务，则大富智造云可自行决定对“您的资料”采取大富智造云认为必要或适当的任何行动，包括但不限于删除该类资料。您特此保证，您对提交给大富智造云的“您的资料”拥有全部权利，包括但不限于全部版权等。您确认，大富智造云没有责任去认定或决定您提交给大富智造云的资料哪些是应当受到保护的，对享有“服务”的其他用户使用“您的资料”，大富智造云也不必负责。 </span>
                              <span>3.3.2 对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保大富智造云免责。</span>
                              <span>3.3.3 在不限制其他补救措施的前提下，发生下述任一情况，大富智造云可立即发出警告，暂时中止、永久中止或甚至终止您的会员资格，删除您的任何现有物品信息，以及您在网站上展示的任何其他资料：(i)您违反本协议；(ii)大富智造云无法核实或鉴定您向大富智造云提供的任何资料；或(iii)大富智造云相信您的行为可能会使您、大富智造云用户或通过大富智造云或大富智造云网站提供服务的第三者服务供应商发生任何法律责任。在不限制任何其他补救措施的前提下，若发现您从事涉及大富智造云网站的诈骗活动，大富智造云可暂停或终止您的账户。 </span>
                              <span>3.3.4 经生效法律文书确认用户存在违法或违反本协议行为或者大富智造云自行判断用户涉嫌存在违法或违反本协议行为的，大富智造云有权在大富智造云中国站上以网络发布形式公布用户的违法行为并做出处罚（包括但不限于限权、终止服务等）。</span>  
                          </p>
                          <p>
                              <span>3.4 服务终止</span>
                              <span>您同意，在大富智造云未向您收费的情况下，大富智造云可自行全权决定以任何理由(包括但不限于大富智造云认为您已违反本协议的字面意义和精神，或您以不符合本协议的字面意义和精神的方式行事)终止您的“服务”密码、账户(或其任何部份)或您对“服务”的使用。您同意，在大富智造云向您收费的情况下，大富智造云应基于合理的怀疑且经电子邮件通知的情况下实施上述终止服务的行为。您进一步确认和同意，大富智造云根据本协议规定终止您服务的情况下可立即使您的账户无效，或注销您的账户以及在您的账户内的所有相关资料和档案，和/或禁止您进一步接入该等档案或“服务”。账户终止后，大富智造云没有义务为您保留原账户中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给您或第三方。此外，您同意，大富智造云不会就终止向您提供“服务”而对您或任何第三者承担任何责任。 </span>
                              <span> 您有权向大富智造云要求注销您的账户，经大富智造云审核同意后，大富智造云将注销您的账户，届时，您与大富智造云基于本协议的合同关系即终止。您的账户被注销后，大富智造云没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。</span>
                          </p>
                      </section>
                      <section>
                          <h3>四、服务费用</h3>
                          <p>
                              <span>大富智造云保留在根据第一条第3款通知您后，收取“服务”费用的权利。另外，您因进行交易、向大富智造云获取有偿服务或接触大富智造云服务器而发生的所有应纳税赋，以及相关硬件、软件、通讯、网络服务及其他方面的费用均由您自行承担。大富智造云保留在无须发出书面通知，仅在网站公示的情况下，暂时或永久地更改或停止部分或全部“服务”的权利。 </span>
                          </p>
                      </section>
                      <section>
                          <h3>五、服务地位</h3>
                          <p>
                              <span>5.1 通过大富智造云提供的平台服务，您可在大富智造云网站上发布交易信息、查询商品或服务信息、达成交易意向并进行交易、对其他会员进行评价、参加大富智造云组织的活动以及使用其它信息服务及技术服务。</span>
                              <span>5.2 大富智造云网站仅作为用户寻找交易对象，就交易事项进行协商，以及获取各类与交易相关的服务的平台，大富智造云不涉及用户间因交易而产生法律关系及法律纠纷。敬请注意，大富智造云不能控制或保证商贸信息的真实性、合法性、准确性，亦不能控制或保证交易所涉及的物品的质量、安全或合法性，以及相关交易各方履行在贸易协议项下的各项义务的能力。大富智造云不会且不能控制交易各方能否履行协议义务。此外，欺诈风险客观存在，您特此明确已经知悉上述提示，并自行承担交易风险。</span>
                          </p>
                      </section>
                      <section>
                          <h3>六、用户授权 </h3>
                          <p>
                              <span>您完全理解并同意不可撤销地授予大富智造云及其关联公司下列权利：</span>
                              <span>6.1 对于您提供的资料，您授予大富智造云及其关联公司全球通用的、永久的、免费的许可使用权利(并有权在多个层面对该权利进行再授权)，使大富智造云及其关联公司有权(全部或部份地)使用、复制、修订、改写、发布、翻译、分发、执行和展示"您的资料"或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将"您的资料"纳入其他作品内。</span>
                              <span>6.2 当您违反本协议或与大富智造云签订的其他协议的约定，大富智造云有权以任何方式通知关联公司，要求其对您的权益采取限制措施包括但不限于要求关联公司将您账户内的款项支付给大富智造云指定的对象，要求关联公司中止、终止对您提供部分或全部服务，且在其经营或实际控制的任何网站公示您的违约情况。 </span>
                              <span>6.3 同样，当您向大富智造云关联公司作出任何形式的承诺，且相关公司已确认您违反了该承诺，则大富智造云有权立即按您的承诺约定的方式对您的账户采取限制措施，包括但不限于中止或终止向您提供服务，并公示相关公司确认的您的违约情况。您了解并同意，大富智造云无须就相关确认与您核对事实，或另行征得您的同意，且大富智造云无须就此限制措施或公示行为向您承担任何的责任。 </span>
                          </p>
                      </section>   
                      <section>
                          <h3>七、服务责任范围</h3>
                          <p>
                              <span>
                                  7.1 您明确理解和同意，大富智造云不对因下述任一情况而发生的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其他无形损失的损害赔偿(无论大富智造云是否已被告知该等损害赔偿的可能性)：(i)使用或未能使用“服务”；(ii)因通过或从“服务”购买或获取任何货物、样品、数据、资料或服务，或通过或从“服务”接收任何信息或缔结任何交易所产生的获取替代货物和服务的费用；(iii)未经批准接入或更改您的传输资料或数据；(iv)任何第三者对“服务”的声明或关于“服务”的行为；或(v)因任何原因而引起的与“服务”有关的任何其他事宜，包括疏忽。
                              </span>
                              <span>
                                  7.2 大富智造云不能随时预见到任何技术上的问题或其他困难。该等困难可能会导致数据损失或其他服务中断。为此，您明确理解和同意，您使用“服务”的风险由您自行承担，且“服务”以“按现状”和“按可得到”的状态提供。大富智造云明确声明不作任何种类的明示或暗示的保证，包括但不限于关于适销性、适用于某一特定用途和无侵权行为等方面的保证。大富智造云对下述内容不作保证：(i)“服务”会符合您的要求；(ii)“服务”不会中断，且适时、安全和不带任何错误；(iii)通过使用“服务”而可能获取的结果将是准确或可信赖的；及(iv)您通过“服务”而购买或获取的任何产品、服务、资料或其他材料的质量将符合您的预期。通过使用“服务”而下载或以其他形式获取任何材料是由您自行全权决定进行的，且与此有关的风险由您自行承担，对于因您下载任何该等材料而发生的您的电脑系统的任何损毁或任何数据损失，您将自行承担责任。您从大富智造云或通过或从“服务”获取的任何口头或书面意见或资料，均不产生未在本协议内明确载明的任何保证责任。
                              </span>
                          </p>
                      </section>   
                      <section>
                          <h3>八、不可抗力</h3>
                          <p>
                              <span>对于因大富智造云合理控制范围以外的原因，包括但不限于自然灾害、罢工或骚乱、物质短缺或定量配给、暴动、战争行为、政府行为、通讯或其他设施故障或严重伤亡事故等，致使大富智造云延迟或未能履约的，大富智造云不对您承担任何责任。 </span>
                          </p>
                      </section>   
                      <section>
                          <h3>九、赔偿 </h3>
                          <p>
                              <span>
                                  您同意，如因您违反本协议或经在此提及而纳入本协议的其他文件，或因您违反法律侵害了第三方的合法权利，或因您违反法律须承担行政或刑事责任，而使第三方或行政、司法机关对大富智造云及其子公司、关联公司、分公司、董事、职员、代理人提出索赔或处罚要求（包括司法费用和其他专业人士的费用），您必须全额赔偿给大富智造云及其子公司、关联公司、分公司、董事、职员、代理人，并使其等免遭损失。 
                              </span>
                          </p>
                      </section>   
                      <section>
                          <h3>十、外部链接 </h3>
                          <p>
                              <span>“服务”或第三者均可提供与其他万维网网站或资源的链接。由于大富智造云并不控制该等网站和资源，您承认并同意，大富智造云并不对该等外在网站或资源的可用性负责，且不认可该等网站或资源上或可从该等网站或资源获取的任何内容、宣传、产品、服务或其他材料，也不对其等负责或承担任何责任。您进一步承认和同意，对于任何因使用或信赖从此类网站或资源上获取的此类内容、宣传、产品、服务或其他材料而造成（或声称造成）的任何直接或间接损失，大富智造云均不承担责任。 </span>
                          </p>
                      </section>   
                      <section>
                          <h3>十一、联系通知</h3>
                          <p>
                              <span>
                                11.1 您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便大富智造云或其他用户与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用大富智造云服务过程中产生任何损失或增加费用的，应由您完全独自承担。您了解并同意，您有义务保持你提供的联系方式的有 效性，如有ECN需要更新的，您应按大富智造云的要求进行操作。 
                              </span>
                              <span>
                                  11.2 除非另有明确规定，任何您与大富智造云之间的通知应以电子邮件形式发送，(就大富智造云而言)电子邮件地址为services@tatfookcloud.com，或 (就您而言)发送到您在登记注册过程中向大富智造云提供的电子邮件地址，或有关方指明的该等其他地址。在电子邮件发出二十四(24)小时后，通知应被视为已送达，除非发送人被告知相关电子邮件地址已作废。或者，大富智造云可通过邮资预付挂号邮件并要求回执的方式，将通知发到您在登记过程中向大富智造云提供的地址。在该情况下，在付邮当日三(3)天后通知被视为已送达。
                              </span>
                          </p>
                      </section>   
                      <section>
                          <h3>十二、法律适用、管辖及其他 </h3>
                          <p>
                              <span>12.1 本协议之效力、解释、ECN、执行与争议解决均适用中华人民共和国大陆地区法律。 </span>
                              <span>12.2 您与大富智造云仅为独立订约人关系。本协议无意结成或创设任何代理、合伙、合营、雇佣与被雇佣或特性授权与被授权关系。</span>
                              <span>12.3 您同意大富智造云因经营业务需要有权将本协议项下的权力义务就部分或全部进行转让，而无须再通知予您并取得您的同意。 </span>
                              <span>12.4 因本协议或大富智造云服务所引起或与其有关的任何争议应向大富智造云所在地人民法院提起诉讼。 </span>
                              <span>
                                  12.5 本协议取代您和大富智造云先前就相同事项订立的任何书面或口头协议。倘若本协议任何条款被裁定为无效或不可强制执行，该项条款应被撤销，而其余条款应予遵守和执行。条款标题仅为方便参阅而设，并不以任何方式界定、限制、解释或描述该条款的范围或限度。大富智造云未就您或其他人士的某项违约行为采取行动，并不表明大富智造云撤回就任何继后或类似的违约事件采取行动的权利。
                              </span>
                          </p>
                      </section>   
                   </div>
                   <div class="cnt-column-text cnt-column-text-Two" v-if="contractNames=='contractTwo'">
                      <el-row class="cnt-column-text-border active">
                        <el-col :span="4" :offset="18" class="column-Two-text">采购订单编号：</el-col>  
                        <el-col :span="12">供应商名称：（以下简称乙方）</el-col>
                        <el-col :span="12">采购商名称：（以下简称甲方）</el-col>
                        <el-col :span="12">供应商地址：</el-col>
                        <el-col :span="12">采购商地址：</el-col>
                        <el-col :span="12">联系电话：</el-col>
                        <el-col :span="12">联系电话：</el-col>
                      </el-row>
                      <el-row class="column-text-Two active">
                        <el-col :span="8">采购单号:</el-col>
                        <el-col :span="10">付款条件:全款预付</el-col>
                        <el-col :span="6">税种:进项 17%</el-col> 
                        <el-col :span="8">采购日期: </el-col>
                        <el-col :span="10">价格条件:供应商配送(包含运费)</el-col>
                        <el-col :span="6">币种:RMB</el-col> 
                      </el-row>
                      <el-row class="column-text-table">
                          <table>
                            <tr>
                                <th>项次</th>
                                <th>品名(MPN)</th>
                                <th>规格</th>
                                <th>数量</th>
                                <th>含税单价</th>
                                <th>含税总价</th>
                                <th>备注</th>
                            </tr>
                            <tr>
                                <td>1</td>
                                <td>侧键</td>
                                <td>J17002-侧键FPC</td>
                                <td>800</td>
                                <td>2.7</td>
                                <td>2160</td>
                                <td></td>
                            </tr>
                            <tr>
                                <td></td>
                                <td></td>
                                <td></td>
                                <td></td>
                                <td></td>
                                <td></td>
                                <td></td>
                            </tr>
                            <tr>
                                <td></td>
                                <td></td>
                                <td></td>
                                <td></td>
                                <td></td>
                                <td></td>
                                <td></td>
                            </tr>
                            </table>
                            <el-col :span="6" :offset="18" class="pull-right active">税前金额合计:1846.15</el-col>
                            <el-col :span="6" :offset="18" class="pull-right active">税后金额合计:2160.00</el-col>
                      </el-row>
                    <div class="column-text-Remarks">
                       <section>
                          <h3>备注：</h3>
                          <p>
                            <span>1,交货方式：乙方负责运输到指定地点，包装运输费用及保险费由乙方承担；</span>
                            <span>2,交期：乙方必须遵守本订购单之交货期，如无法达成，应书面回传及电话通知确认后调整交货期；</span>
                            <span>3,乙方应对每批产品在外包装及送货单上标明订单号及品名；</span>
                            <span>4,验收标准：乙方提供的产品以甲方上传的图纸为验收标准,乙方每次供货时应附上出货检验报告等；</span>
                          </p>
                      </section>
                    </div>
                   </div>
                   <div class="cnt-column-text cnt-column-text-Three" v-if="contractNames=='contractThree'">
                       <section>
                          <h3>概况</h3>
                          <p>
                            <span>您的信任对我们非常重要，我们深知个人信息对您的重要性，我们将按法律法规要求，采取相应安全保护措施，尽力保护您的个人信息安全可控。鉴此，大富智造云平台服务提供者（或简称“我们”）制定本《隐私政策》（下称“本政策”）并提醒您：</span>
                            <span>本隐私政策 ("本政策") 适用于大富智造云平台所有个人信息收集和产品或服务。如我们关联公司的产品或服务中使用了大富智造云平台提供的产品或服务但未设独立的隐私政策的，则本政策同样适用于该部分产品或服务。</span>
                            <span>需要特别说明的是，本政策不适用于其他第三方向您提供的服务，也不适用于大富智造云平台中已另行独立设置隐私政策的产品或服务。例如大富智造云平台上的卖家依托平台向您提供服务时，您向卖家提供的个人信息不适用本政策。</span>
                            <span>在使用大富智造云平台各项产品或服务前，请您务必仔细阅读并透彻理解本政策，在确认充分理解并同意后使用相关产品或服务。一旦您开始使用大富智造云平台各项产品或服务，即表示您已充分理解并同意本政策。如对本政策内容有任何疑问、意见或建议，您可通过suggest@tatfookcloud.com与我们联系。</span>
                          </p>
                      </section>
                      <section>
                          <h3>隐私政策</h3>
                          <p>
                            <span>本隐私政策将帮助您了解以下内容：</span>
                            <span>1、我们如何收集和使用您的个人信息；</span>
                            <span>2、我们如何使用Cookie和同类技术；</span>
                            <span>3、您如何使用本网站；</span>
                            <span>4、版权声明；</span>
                            <span>5、隐私协议；</span>
                            <span>6、加工文件内容的限制和禁止；</span>
                            <span>7、信息的储存及限制；</span>
                            <span>8、本隐私政策如何更新；</span>
                            <span>9、如何联系我们。</span>
                          </p>
                      </section>
                      <section>
                          <h3>一、我们如何收集和使用您的信息</h3>
                          <p>
                            <span>我们会出于本政策所述的以下目的，收集和使用您的个人信息：</span>
                            <span>（一）帮助您成为我们的会员</span>
                            <span>为成为我们的会员，以便我们为您提供会员服务，您需要提供手机号码、联系人姓名，并创建会员名和密码。如果您仅需使用浏览、搜索等基本服务，您不需要注册成为我们的会员及提供上述信息。</span>
                            <span>如果您提供以下额外资料补全账号信息，将有助于我们给您提供产品报价等服务：您的真实姓名、联系方式、主营行业、收货地址等。如果您不提供这些信息，将会影响到您使用平台采购报价服务，但不会影响使用大富智造云平台基本浏览、搜索功能。</span>
                            <span>（二）为您展示和推送产品或服务</span>
                            <span>为改善我们的产品或服务、向您提供个性化的信息搜索及交易服务，我们会根据您的浏览及搜索记录、设备信息、位置信息、订单信息，提取您的浏览、搜索偏好、行为习惯、位置信息等特征，基于特征标签进行间接产品服务展示、推送信息。</span>
                            <span>（三）向您提供产品或服务</span>
                            <span>为便于向您提供我们的产品或服务，我们会记录您提供的信息，例如您提供的联系人姓名、联系电话等。我们的一些产品或服务需要付费才能使用，当您需要使用这些付费产品或服务时，您需要提供您的银行卡信息及/或绑定支付宝、微信等服务，以便我们了解您的支付状态。</span>
                            <span>（四）为您提供安全保障</span>
                            <span>
                                请注意，为确保企业会员身份真实性、向您提供更好的安全保障，您可以向我们提供企业营业执照等信息完成实名认证。如您拒绝提供上述信息，可能无法使用企业账号管理、开通成为供应商、线上接单、线上报价等服务，但不会影响您使用浏览、搜索等服务。
                            </span>
                            <span>（五）其他用途</span>
                            <span>
                                我们将信息用于本政策未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的时，会事先征求您的同意。
                            </span>
                            <span>（六）征得授权同意的例外</span>
                            <span>
                                根据相关法律法规规定，以下情形中收集您的个人信息无需征得您的授权同意：
                            </span>
                               <span>1、与国家安全、国防安全有关的；</span>
                               <span>2、与公共安全、公共卫生、重大公共利益有关的；</span> 
                               <span>3、与犯罪侦查、起诉、审判和判决执行等有关的；</span> 
                               <span>4、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；</span>
                               <span>5、所收集的个人信息是您自行向社会公众公开的；</span>
                               <span>6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；</span>
                               <span>7、根据您的要求签订合同所必需的；</span>
                               <span>8、用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；</span>
                               <span>9、为合法的新闻报道所必需的；</span>
                               <span>10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；</span>
                               <span>11、法律法规规定的其他情形。</span>
                          </p>
                      </section>
                      <section>
                          <h3>二、我们如何使用Cookie和同类技术</h3>
                          <p>
                            <span>（一）Cookie</span>
                            <span>为确保网站正常高效运转、为您获得更轻松的访问体验、向您推荐您可能感兴趣的内容，我们会在您的计算机或移动设备上存储相关信息：这些信息可能是Cookie、Flash Cookie，或您的浏览器或关联应用程序提供的其他本地存储（统称“Cookie”）。请您理解，我们的某些服务只能通过使用Cookie才可得到实现。如果您的浏览器或浏览器附加服务允许您可以修改对Cookie的接受程度或者拒绝我们的Cookie，但拒绝我们的Cookie在某些情况下可能会影响您安全访问网站和使用我们提供的服务。</span>
                            <span>（二）网站信标和像素标签</span>
                            <span>除Cookie外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的地址链接，如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好以便于我们主动改善客户服务体验。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。</span>
                          </p>
                      </section>
                      <section>
                          <h3>三、您如何使用本网站 </h3>
                          <p>
                            <span>1、本网站会根据实际情况对现有服务项目、流程进行适当调整以及ECN，本网站会在调整、ECN后在网站予以通知，请用户使用服务前仔细阅读并了解新的服务项目、流程，否则对由此产生的问题，本网站不承担任何责任。</span>
                            <span>2、一切上传本网站的模型文件和图纸资料，您都保证会安全保管原始文档，本网站将不对任何非本网站原因导致您原始文档丢失的行为负责，也不对任何导致您上传的模型文件丢失的原因负责。 </span>
                            <span>3、如果您的图纸文件内容违反国家法律规定或超过本条款规定的限制，我们会立即删除。如果一经发现您有违反相关法律法规的行为，我们将依法上报该情况至相关国家监管部门。 </span>
                            <span>4、如果您通过本网站发送订单，您需了解并同意：</span>
                            <span>当您的加工订单上传到网站并已经开始生产后，订单将不可取消。如果特殊原因需要更新图纸或者取消订单，则网站会根据加工进度来核算实际成本，将扣除已经产生的成本后的部分退还给客户。</span>
                            <span>如果您的加工文件含有违反国家法律、法规的内容，我们有权撤销您的订单。 </span>
                            <span>如果您收到的个性化产品出现质量问题，我们将尽快协助您解决问题。</span>
                            <span>如果因您的主观原因而造成误加工，本网站将尽量与您协商解决，但由此发生的费用由您自行承担。</span>
                          </p>
                      </section>
                      <section>
                          <h3>四、版权声明</h3>
                          <p>
                            <span>1、经由我们向您提供的所有信息，包括但不限于文字、软件、声音、相片（图片）、录像、图表、商标和其它商业信息资料等，均受中华人民共和国著作权法、商标法、专利法和其它财产法律保护。任何人只有在得到我们的书面授权的情况下，方可使用这些信息；如未取得我们事先的书面授权，您将不得擅自使用、复制、发行这些信息、软件、代码、商标或资料，也不得修改、创造衍生的可能侵犯在先权利的作品。</span>
                            <span>2、当您提交加工图纸模型进行加工时，您应当保证并确认您拥有所有3D设计模型，相片（图片）及有关文字的著作权、使用资格与权益。我们声明，对您加工产品中的设计、模型、相片（图片）、文字我们均不享有任何所有权。</span>
                          </p>
                      </section>
                      <section>
                          <h3>五、隐私保护 </h3>
                          <p>
                            <span>我们尊重您个人的隐私。未经您的同意，我们将不会向任何第三方披露您提交的个人信息、模型、图纸、设计、相片（图片）、文字、加工文件。</span>
                          </p>
                      </section>
                      <section>
                          <h3>六、加工文件内容的限制和禁止</h3>
                          <p>
                            <span>您提交的用于加工的模型、图纸、相片（图片）内容、文字内容必须符合中华人民共和国法律法规的规定，您不可储存、刊登或分发任何非法的、为法律所禁止的内容。 这些内容包括但不限于：</span>
                            <span>1、侵犯或可能侵犯任何第三方知识产权或其他合法权益的内容；</span>
                            <span>2、构成或可能构成反社会或刑事违法（包括歧视、谋杀、虐待、人身伤害、跟踪、儿童色情及性骚扰）的内容；</span>
                            <span>3、违反或可能违反公共秩序、保密规定和社会公德的内容；</span>
                            <span>4、危害本网站或其他网站安全的电脑病毒或工具；</span>
                            <span>5、煽惑、建议或鼓励任何违法活动的内容；</span>
                            <span>6、有关任何个人（除您以外）的个人资料（如姓名、电话号码、地址等）。</span>
                            <span>7、所有带有上述内容的相片（图片）和资料都不予退还。如果一经发现您有违反相关法律法规的行为，我们将依法上报该情况至相关国家监管部门。</span>
                          </p>
                      </section>
                      <section>
                          <h3>七、信息的储存及限制 </h3>
                          <p>
                            <span>本网站有权判定用户行为是否符合本网站服务条款的要求，如果用户违反本网站服务条款的规定，本网站有权暂停其账号的使用。本网站不承诺长期保存您的加工文件。用户在加工完成后，有权到个人中心删除所上传的模型及文件，用户删除后，文件数据将从大富智造云平台系统中彻底删除。</span>
                            <span>如果企业用户在连续360天内没有对该企业进行文件上传审核，本网站将视为该企业用户自行放弃企业账号的使用权，本网站将保留暂停为其提供服务的权利。</span>
                            <span>个人用户在连续720天内没有登录、查看或使用用户账号，并且其账户余额为0，本网站将视为该企业用户自行放弃企业账号的使用权，本网站将保留暂停为其提供服务的权利。 </span>
                          </p>
                      </section>
                      <section>
                          <h3>八、本隐私政策如何更新</h3>
                          <p>
                            <span>我们的隐私政策可能ECN。</span>
                            <span>未经您明确同意，我们不会限制您按照本隐私政策所应享有的权利。我们会在专门页面上发布对隐私政策所做的任何ECN</span>
                            <span>对于重大ECN，我们还会提供更为显著的通知（包括我们会通过公告通知甚至向您提供弹窗提示）。</span>
                          </p>
                      </section>
                      <section>
                          <h3>九、如何联系我们</h3>
                          <p>
                            <span>您可以通过以下方式与我们联系，我们将在5天内回复您的请求：</span>
                            <span>1、如对本政策内容有任何疑问、意见或建议，您可通过suggest@tatfookcloud.com与我们联系；</span>
                            <span>2、我们还设立了个人信息保护专职部门，如发现个人信息可能被泄露，您可以通过privacy@tatfookcloud.com与我们联系。</span>
                          </p>
                      </section>
                   </div>
                   <div class="cnt-column-text cnt-column-text-Four" v-if="contractNames=='contractFour'">
                      <section>
                          <h3>【审慎阅读】您在申请注册流程中点击同意前，应当认真阅读以本注册协议（以下简称“协议”）。请您务必审慎阅读、充分理解协议中相关条款内容，其中包括：</h3>
                          <p>
                            <span>1、与您约定免除或限制责任的条款；</span>
                            <span>2、与您约定法律适用和管辖的条款；</span>
                            <span>3、其他以粗体下划线标识的重要条款。</span>
                          </p>
                      </section>
                      <section>
                          <h3>如您对协议有任何疑问，可向大富智造云服务中心（请点击）咨询</h3>
                          <p>
                            <span>【特别提示】 您已充分理解，大富智造云是一个商业贸易制造采购平台，而并非面向消费者的消费购买市场，当您按照注册页面提示填写信息、阅读并同意协议且完成全部注册程序后，即表示您已充分阅读、理解并接受协议的全部内容，并将基于您的真实贸易需求而使用大富智造云平台服务。如您因大富智造云服务与大富智造云发生争议，应适用《大富智造云服务协议》处理；如您在使用大富智造云服务中与其他用户发生争议，依您与其他用户达成的协议处理。</span>
                            <span>阅读协议的过程中，如果您不同意相关协议或其中任何条款约定，您应立即停止注册程序。</span>
                          </p>
                      </section>
                      <section>
                          <p class="activeClick" @click="btnscroll(contractData[0],0)">《大富智造云服务协议》</p>
                          <p class="activeClick" @click="btnscroll(contractData[2],2)">《隐私政策》</p>
                      </section>
                   </div>
                   <div class="cnt-column-text cnt-column-text-Five" v-if="contractNames=='contractFive'">
                      <section>
                          <h3>本协议在如下双方之间达成：</h3>
                          <p>
                            <span>1、深圳市大富科技股份有限公司，根据中华人民共和国的法律成立和存续，营业地址在中国深圳宝安区沙井蚝乡路大富科技园（之后称“大富”)。</span>
                            <span>2、___________，根据___________法律成立和存续，营业地址在___________，企业代码为：（之后称“公司”）。</span>
                          </p>
                      </section>
                      <section>
                          <h3>鉴于：</h3>
                          <p>
                            <span>1、为了评估协议方之间关于___________可能的业务关系的可行性，及了上述评估所达成的可能的双方的业务关系（之后称“目的”）</span>
                            <span>2、由于上述关系并且为了双方利益，协议方可能会以口头、示范、设计、仪器、模型、样品、计算机程序、磁介质、文件、规格书、电路图、或图纸等和直接观察的方式彼此披露关于他们各自在业务、市场、客户、价格、设备、产品、技术、工艺等方面技术、财务和/或商业信息，上述信息是由披露方或者其关联公司所有（之后称“信息”），并且协议方愿意采取措施限制上述信息的使用和进一步披露。</span>
                          </p>
                      </section>
                      <section>
                          <h3>协议双方一致同意：</h3>
                          <p>
                            <span>1、任何一方（之后称“接收方”）应对无论何种形式从另一方（之后称“披露方”）收到的所有信息严格保密，并且除非有本协议或协议方之间任何合同的条款许可或书面授权,无披露方的书面许可不应向第三方披露。</span>
                            <span>2、受制于前述条款，任何一方应严格限定从另一方接收的信息的使用权，只有为达成   本协议目的有必要知晓的雇员才可以使用，并且需要告知其雇员就本协议所承担的责任。无论哪一方都将不允许其未签个人保证的雇员以任何形式获准使用机密资料。接收方应对任何信息的遗失、失窃或者其他由于疏忽而致的披露，以及接收方在本协议下有权向其披露信息的人（包括但不限于现有和以前的雇员）或实体所进行的任何未经授权的披露负责。</span>
                            <span>3、接收方在任何情况下都应以对待其自身信息一样的敏感度和重要性保持披露方信息的机密性，并且一旦发现任何由于疏忽或未经授权的信息披露，接收方应立即通知披露方，并采取合理措施减轻前述披露的影响，防止任何进一步的披露或者未经授权的使用。</span>
                            <span>4、任何一方均不得公开、发布或者提及本协议、另一方、从另一方收到的信息或者双方谈判或合作的信息。</span>
                            <span>5、无论本协议还是信息的披露或接收均不构成或者意味着任何一方承诺或意图购买任何产品或服务，或者承担现在或未来行销任何产品或服务的义务，或者任何进入任何其他业务安排的承诺或意图。</span>
                            <span>6、由大富公司向供应商的信息披露，并不授权或意味着对大富公司或第三方所拥有的任何知识产权权利的进行任何许可。</span>
                            <span>7、如果信息是由大富披露，所有包含信息或与之相关的材料归大富所有，必须由供应商自付费用依大富的书面要求予以返还或者销毁。这些材料包括但不限于不合格的图纸、便条纸、底片、电脑的输入或输出并包括所有相关的备份。</span>
                            <span>8、在大富公司内活动时，供应商应听从接待人员的安排和引导。未经大富公司接待人员允许不得进入其实验室、办公室、车间等工作环境，不与大富公司技术人员进行私下交流。   </span>
                            <span>9、如果供应商的雇员因双方合作关系而需要在大富公司办公的，则供应商应当保证其前述雇员遵守本保密协议的规定以及大富公司的各项规章制度，服从大富公司的管理。同时，对于前述供应商雇员在大富公司的一切行为，供应商承担连带责任。</span>
                            <span>10、如果供应商违反上述任何条款，大富公司有权根据违反的程度以及造成的损害采取以下措施：（1）重新评估供应商的地位；（2）终止双方的合作；（3）要求赔偿损失。</span>
                            <span>11、本协议在双方正式签字之日起生效。本协议的规定应可追溯地适用于生效日之前协议双方在讨论与谈判中所披露的任何机密信息。</span>
                            <span>12、本协议中包含的义务应当延续到任何谈判或合同的终结之后，无时间上的限制，除非并直到任何机密信息并非因信息接收方的过错进入公众领域为止。并且该义务效力不受本协议期限届满或终止的影响。</span>
                            <span>13、接收方应遵循任何关于从披露方收到的信息或者产品的出口管制法律法规。</span>
                            <span>14、本协议的文本采用中英文两种语言，中文为主导语言。</span>
                            <span>15、本协议适用中华人民共和国法律解释和管辖，但不适用其对法律的选择。
                            任何与本协议相关的争议应最终由仲裁解决。仲裁员应由中国深圳仲裁委员会任命并遵循其仲裁规则。裁决为终局的并对双方均有约束力，可以由任何有管辖权的法庭予以强制执行。仲裁应于中国深圳进行。</span>
                          </p>
                      </section>
                      <section>
                          <p>
                             兹此见证，协议双方在如下日期由各自全权代表签署本协议。
                          </p>
                          <p>
                             本协议一式四份，甲方执三份，乙方一份，具有同等法律效力。
                          </p>
                      </section>
                   </div>
                 <div class="cnt-column-text cnt-column-text-Six" v-if="contractNames=='contractSix'">
                        <section id="on1">
                          <h3>1.企业用户和个人用户有什么区别？</h3>
                          <p>
                            <span>企业用户是以企业为主体进行注册的用户，平台对企业提交的资料进行严格审核。企业用户可以在平台发布需求，也可以在升级为供应商后在平台接单。而个人用户目前仅可作为需求方，不可以升级为供应商。</span>
                          </p>
                      </section>
                        <section id="on2">
                          <h3>2.如何注册？</h3>
                          <p>
                            <span>在非登录状态时，平台任何页面的右上角有“注册”链接，点击进入注册页面。注册分为个人用户和企业用户，个人用户使用手机号注册，企业用户需填写帐号信息、企业名称、企业联系人等信息进行注册。</span>
                          </p>
                      </section>
                        <section id="on3">
                          <h3>3.如何登陆？</h3>
                          <p>
                            <span>在平台任何页面又上角有“登录”链接，点击进入登录页面。登录页面分为个人用户和企业用户登录，企业用户输入企业名称、账号名、密码，点击“登录”完成登录。个人用户填写注册时使用的手机号、密码，“点击登录完成登录”。</span>
                            <span>在未登录状态填写了需求后，点击“提交需求”时，系统会弹出登录窗口引导您登录。</span>
                          </p>
                      </section>
                        <section id="on4">
                          <h3>4.平台使用是否需要付费？</h3>
                          <p>
                            <span>不收费。目前平台所有服务均不收取额外费用。</span>
                          </p>
                      </section>
                        <section id="on5">
                          <h3>5.如何成为供应商？</h3>
                          <p>
                           <span>企业用户注册成功后，登录进入“管理中心”，在“供应商”菜单下找到“成为供应商”，填写供应商基础资料并提交后，平台工作人员将与您联系核对资料信息，完成后您就可以享受更多服务了。</span>
                          </p>
                      </section>
                      <section id="on6">
                          <h3>6.如何修改企业信息？</h3>
                          <p>
                            <span>进入“管理中心”，在“供应商”菜单下找到“企业资料”页，在页面中点击“修改资料”选项卡，然后修改您的企业信息。您需要注意，部分信息，如：企业证件、提供服务的工艺、企业名称、企业地址等修改后，需要通过平台工作人员与您联系并审核通过后信息才生效。</span>
                          </p>
                      </section>
                        <section id="on7">
                          <h3>7.为什么要完善企业信息？</h3>
                          <p>
                            <span>作为供应商，您的企业资料的完整度将会影响平台对您的评级，更会影响到客户能否了解、信任您的企业。</span>
                          </p>
                      </section>
                        <section id="on8">
                          <h3>8.子帐号是什么？如何设置子账号？</h3>
                          <p>
                            <span>企业用户拥有子帐号权限，作为企业管理员，您可以建立多个不同权限的子帐号来协助您管理。进入“管理中心”，在“子帐号”菜单下找到“子帐号管理”，在页面右侧点点击“添加员工帐号”，输入员工的信息后即可完成添加。</span>
                          </p>
                      </section>
                        <section id="on9">
                          <h3>9.如何设置子帐号的权限？</h3>
                          <p>
                           <span>进入“管理中心”，在“子帐号”菜单下找到“子帐号管理”，在修改或添加子帐号页面中有“权限”块，被勾选的就是当前帐号拥有权限的功能。</span>
                          </p>
                      </section>
                        <section id="on10">
                          <h3>10.子帐号如何登陆？</h3>
                          <p>
                           <span>企业用户拥有子帐号权限，登录方式与企业管理员一致。</span>
                          </p>
                      </section>
                        <section id="on11">
                          <h3>11.如何设置我的账号信息？</h3>
                          <p>
                            <span>进入“管理中心”，在“设置”菜单下找到“帐号设置”。页面中可以修改帐号资料，如：头像、姓名、职位、邮箱等信息。在“修改密码”中可以修改密码和手机号。</span>
                          </p>
                      </section>
                        <section id="on12">
                          <h3>12.如何设置消息提醒？</h3>
                          <p>
                            <span>如果您是企业管理员，则可以“设置”菜单下找到“提醒设置”，在这里您可以管理几种公共消息的提醒，您设置的子帐号将可以收到消息提醒，具体提醒方式各帐号可以自行设置。</span>
                            <span>如果您拥有企业子帐号或者您是个人用户，则可以在“设置”菜单下找到“帐号管理”，在页面中切换到“提醒设置”，在这里您可以设置每一种消息的提醒方式。</span>
                          </p>
                      </section>
                        <section id="on13">
                          <h3>13.消息提醒有几种方式？</h3>
                          <p>
                            <span>消息提醒分为3种方式：站内消息、邮件、短信。其中邮件、短信会发送到您帐号绑定的邮箱、手机号上。</span>
                          </p>
                      </section>
                        <section id="on14">
                          <h3>14.如何提交询盘需求？</h3>
                          <p>
                            <span>您可以在平台任何页面的头部右侧找到按钮“发布需求”，选择您需求的主工艺后进入需求发布页面。在需求发布页，您需要填写询价信息、零件信息。需要注意的时，一个询价单中最多可添加10个零件。</span>
                          </p>
                      </section>
                        <section id="on15">
                          <h3>15.询价方式中的平台询价是什么？</h3>
                          <p>
                            <span>平台询价是指您将需求委托给平台，平台将在优质供应商库中挑选出符合您要求的供应商为您报价。</span>
                          </p>
                      </section>
                      <section id="on16">
                          <h3>16.询价方式中的公开询盘是什么？</h3>
                          <p>
                            <span>公开询盘是指将您的需求发布到“最新询盘”中，符合需求条件的供应商可以主动参与报价。</span>
                          </p>
                      </section>
                        <section id="on17">
                          <h3>17.询价方式中的指定供应商是什么？</h3>
                          <p>
                           <span>指定供应商是指将询盘信息发送给指定的供应商来询价。目前一次最多可以指定发送给9家供应商。</span>
                          </p>
                      </section>
                        <section id="on18">
                          <h3>18.我要如何参与报价？</h3>
                          <p>
                           <span>参与报价的途径有3种。1、平台推送需求给您，2、客户制定您为其报价，3、去“最新询盘”中找您感兴趣的需求去报价。</span>
                          </p>
                      </section>
                        <section id="on19">
                          <h3>19.为什么要填写企业设置信息？</h3>
                          <p>
                           <span>企业设置是为了配置一些公共的信息，例如：您企业支持的发票类型、支持的配送方式、您的收款账号等信息。企业设置中必填信息未配置将无法参与报价。</span>
                          </p>
                      </section>
                        <section id="on20">
                          <h3>20.如何下载需求报价的图纸等文件？</h3>
                          <p>
                            <span>在您收到报价或参与报价时，可以查看需求的详情，在详情的零件中可以看到附件，点击附件名称即可下载。</span>
                          </p>
                      </section>
                      <section id="on21">
                          <h3>21.如何发布产品案例？为什么要发布产品案例？</h3>
                          <p>
                            <span>企业的产品案例有利于企业的宣传，让客户了解企业实力。进入“管理中心”，在“供应商”菜单下的“产品案例”中，点击右侧按钮“发布新按钮”可以添加案例图片、填写案例信息进行发布。</span>
                          </p>
                      </section>
                        <section id="on22">
                          <h3>22.如何提交订单？</h3>
                          <p>
                            <span>在您发布需求并收到报价后，在“发布的需求”中点击“查看报价”可以进入报价清单，其中包含所有的报价，您对供应商的报价满意时，点击“接受报价”后立即可以看到“去下单”按钮，点击按钮填写数量确定后进入下单页面，在页面中填写必要信息后可完成订单提交。</span>
                          </p>
                      </section>
                        <section id="on23">
                          <h3>23.资金如何保障？</h3>
                          <p>
                            <span>如果采用全款现结，则您支付的货款将由平台委托第三方进行监管，当您确认收货后由第三方将货款支付给供应商。如果采用月结，在您支付完成后，平台将24小时内支付给供应商。</span>
                          </p>
                      </section>
                        <section id="on24">
                          <h3>24.如何查看报价？什么时候才能知道供应商报价了？</h3>
                          <p>
                            <span>在提交需求后，无论询价方式是哪一种，一旦有供应商为您的需求进行报价，您将收到报价提醒，具体提醒方式根据您在帐号管理中的设置。可以在“发布的需求”中点击“查看报价”看到各供应商的报价。</span>
                          </p>
                      </section>
                        <section id="on25">
                          <h3>25.如何才能正常浏览使用平台？（浏览器版本，分辨率）</h3>
                          <p>
                            <span>平台支持IE9以上浏览器，建议使用最新IE、edge、谷歌、火狐浏览器。支持屏幕最小分辨率为1280*720，建议最佳分辨率为1920*1080。</span>
                          </p>
                      </section>
                      <section id="on26">
                          <h3>26.如何确认收货？</h3>
                          <p>
                            <span>在您收到货物后，在“发起的订单”中找到货物相关订单，点击“确认收货”即可完成订单，如果您在发货后15日未确认收货，系统将自动为您确认收货。确认收货后平台会将货款转入供应商账户。</span>
                          </p>
                      </section>
                        <section id="on27">
                          <h3>27.如何评价供应商？</h3>
                          <p>
                            <span>您确认收货后，即可在订单中评价供应商。您的评价会显示在供应商的主页中，提供给更多用户参考。</span>
                          </p>
                      </section>
                        <section id="on28">
                          <h3>28.如何查看供应商详情？</h3>
                          <p>
                            <span>您可以在供应商库中浏览供应商，点击供应商名称即可进入供应商主页。在供应商主页中，您可以看到供应商的基本信息、资质信息、设备清单、产品案例、企业评价等信息。</span>
                          </p>
                      </section>
                        <section id="on29">
                          <h3>29.如何支付订单？</h3>
                          <p>
                           <span>在您提交订单后，可为订单付款。目前支持的付款方式有：微信、支付宝、线下支付、银联支付。如果是线下支付，您需要在支付后提交支付凭证供供应商确认。</span>
                          </p>
                      </section>
                        <section id="on30">
                          <h3>30.结算方式有哪些？有什么区别？</h3>
                          <p>
                            <span>目前平台支持结算方式有：全款现结、月付（30日、60日、90日）。全款现结需要在订单生成后进行付款，如果是月付则在每月会提醒您支付上个月的月结订单。</span>
                          </p>
                      </section>
                      <section id="on31">
                          <h3>31.线下支付如何上传支付凭证？</h3>
                          <p>
                            <span>目前仅线下支付需要上传支付凭证，订单生成后在“发起的订单”中可以看到您待支付的订单，点击“确认支付”可上传一张支付凭证图片，支付凭证可以是（不限于）：对账单、回执单、付款记录等图片。</span>
                          </p>
                      </section>
                        <section id="on32">
                          <h3>32.如何取消订单？</h3>
                          <p>
                           <span>在供应商确认订单前，您可以取消订单。在“发起的订单”中交易操作栏点击“取消订单”确认后订单将被取消。找不到“取消订单”按钮说明该订单已不可取消，如果在此状态下仍然需要取消订单，请联系供应商处理。</span>
                          </p>
                      </section>
                        <section id="on33">
                          <h3>33.如何申请退款？</h3>
                          <p>
                           <span>在供应商确认订单后供应商发货前，您可以为订单申请退款。在“发起的订单”中商品信息栏点击“退款”向供应商申请退款，供应商收到后将在线下联系您商议具体退款金额。供应商填写退款金额后，为了防止供应商填写的退款金额与您要求的不符，您需要对金额进行确认，然后平台会为您执行退款。</span>
                          </p>
                      </section>
                        <section id="on34">
                          <h3>34.取消订单后多久能收到退款？</h3>
                          <p>
                           <span>在双方就退款事宜达成一致后，如果支付方式为微信则您可以在10分钟内收到退款，如果使用的其他支付方式，平台工作人员确认后将在半小时内为您退款，原则上不会超过3小时。</span>
                          </p>
                      </section>
                        <section id="on35">
                          <h3>35.如何获得发票？</h3>
                          <p>
                           <span>在发货后，您可以在“发票”菜单下找到“我的发票”，页面中将显示您还没有开票的订单，点击“申请开票”供应商将收到您的开票请求，供应商会根据您的要求进行开票。如果订单完成时您仍然未申请开票，则系统会自动为您提交开票申请。</span>
                          </p>
                      </section>
                        <section id="on36">
                          <h3>36.收货后出现问题如何进行售后？</h3>
                          <p>
                           <span>如果您收货后出现问题，您可以联系供应商要求为您解决。如果供应商不配合，您可以在“售后”菜单中找到“申请售后”，选择需要申请售后的订单后填写申请信息后，平台工作人员将联系您，必要时将请专业工程师进行责任鉴定。</span>
                          </p>
                      </section>
                      <section id="on37">
                          <h3>37.多久可以收到报价？</h3>
                          <p>
                           <span>收到报价的时间一般取决于您的询价方式，平台询价时一般不超过2小时可收到报价。指定供应商和公开询价一般不会超过24小时。</span>
                          </p>
                      </section>
                      <section id="on38">
                          <h3>38.什么是电子合同？如何生成电子合同？</h3>
                          <p>
                            <span>1、电子合同,是指通过电子计算机网络系统设立的平等民事主体之间权利义务关系,并以电子邮件和电子数据交换等形式签订的协议.</span>
                            <span>2、在订单提交前，您需要填写并确认合同抬头信息，提交后系统将为您生成电子合同，此时合同并未生效。当供应商收到您的订单并确认接单后，电子合同生效。</span>
                          </p>
                      </section>
                   </div>
                   <!-- <div class="cnt-column-text cnt-column-text-Seven" v-if="contractNames=='contractSeven'">
                       
                   </div> -->
               </div>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    data() {
        return {
          contractNames:'contractOne',
          contractTitle:'大富智造云服务协议',
          names:'服务协议',
          contractData:[
            {
              name:'服务协议',
              className:'active',
              contractName:'contractOne',
              contractTitle:'大富智造云服务协议'
            },{
              name:'合同条款',
              className:'',
              contractName:'contractTwo',
              contractTitle:'采购订单',
            },{
              name:'隐私政策',
              className:'',
              contractName:'contractThree',
              contractTitle:'隐私政策'
            },{
              name:'注册协议',
              className:'',
              contractName:'contractFour',
              contractTitle:'注册协议'
            },{
              name:'保密协议',
              className:'',
              contractName:'contractFive',
              contractTitle:'供应商保密协议'
            },{
              name:'常见问答',
              className:'',
              contractName:'contractSix',
              contractTitle:'常见问答' 
            }
          ]
        }
    },
    /*不刷新页面动态获取Router值*/
    watch:{
    '$route' (to, from) {
        let item='';
        this.scrollPublic(item,this.$route.query.index)
        if(parseInt(this.$route.query.index)==5&&this.$route.query.id !=undefined){
            setTimeout(() => {
            this.OnscrollTop(this.$route.query.id);
         }, 100);
         }
        }
    },
    methods: {
      /*初始化*/
      updateScroll(){
        let item='';
        let index=this.$route.query.index!=undefined?parseInt(this.$route.query.index):0;
        this.scrollPublic(item,index)
        if(parseInt(this.$route.query.index)==5&&this.$route.query.id !=undefined){
            setTimeout(() => {
            this.OnscrollTop(this.$route.query.id);
         }, 100);
         }
      },

      /*左侧导航*/
      btnscroll(item,index){
        this.scrollPublic(item,index)
        this.$router.push({path:'/contract', query: {index: index}})
      },

      scrollPublic(item,index){
       if(index<=this.contractData.length){
        for(let i=0;i<this.contractData.length;i++){
        this.contractData[i].className='';
         }
         this.contractData[index].className='active';
         this.contractTitle=item !=''?item.contractTitle:this.contractData[index].contractTitle;
         this.contractNames=item !=''?item.contractName:this.contractData[index].contractName;
         this.names=item !=''?item.name:this.contractData[index].name;
         window.scrollTo(0,0);
        }   
      },
        OnscrollTop(val){
        var _id = document.getElementById(val);
    　　window.scrollTo(0,_id.offsetTop+50);
    },

      /*滚动导航跟随*/ 
      scroll(){
        let navColumn = document.getElementById('nav-column');
            window.onscroll=function(){
            let scrolltop=document.documentElement.scrollTop||document.body.scrollTop;
            if(scrolltop >=70){
                navColumn.className="nav-column nav-column-fix";
            }else{
            navColumn.className="nav-column nav-column-abs";
            }
            }
      },
    },
    mounted() {
       this.scroll();
       this.updateScroll();
    },
}
</script>

<style scoped lang="less">
    .pull-block{display:block;}
    .pull-right{text-align: right;}
    .pull-cursor{cursor: pointer;}
    #contract-cnt{
        width: 100%;
        box-sizing: border-box;
        zoom: 1;
        .contract-main{
          width: 1200px;
          margin-left: auto;
          margin-right: auto;
          margin-top: 33px;
        }
        .bread-crumb{
          font-size: 14px;
          color: #333; 
          span+span{color: #909090;}
        }
        .contract-box{
          margin-top: 22px;
          position: relative;
          min-height: 500px;
          .nav-column{
            width: 170px;
            background-color: #ffffff;
            box-shadow: 0px 0px 13px 0px rgba(0, 0, 0, 0.1);
            z-index:1;
            span{text-align: center;display:block;}
            .nav-column-title{
                font-family: MicrosoftYaHei;
                font-size: 16px;
                font-weight: normal;
                font-stretch: normal;
                letter-spacing: 1px;
                color: #3f8def;
                margin: 15px 0 20px 0;
                &::before,&::after{
                  content:'';
                  width: 15px;
                  height: 2px;
                  background-color: #3f8def;
                  display:  inline-block;
                  vertical-align: middle;
                }
                &::before{
                    margin-right: 4px;
                }
                &::after{
                    margin-left: 2px;
                }
            }
            .nav-column-text{
              padding: 0 12px 16px 12px;
              box-sizing: border-box;
              span+span{margin-top: 14px;}
              span{
               width: 147px;
               height: 42px;
               line-height: 42px;
               text-align: center;
               background-color: #f3f3f3;
               display: block;
               cursor: pointer;
               color: #888888;  
               &:hover{
                    color:#fff;
                    background-color: #3f8def;
                    -webkit-transition: all 300ms;
                    -o-transition: all 300ms;
                    transition: all 300ms;
                } 
              }
              .active{
                color: #fff;
                background-color: #3f8def;
                -webkit-transition: all 200ms;
                -o-transition: all 200ms;    
                transition: all 200ms;
              }
            }
          }
          .nav-column-abs{
            position: absolute;
            top: 0;
            left: 0;
          }
          .nav-column-fix{
            position: fixed;
            top: 115px;
            left: 50%;
            margin-left: -600px;  
          }
          .cnt-column{
            width: 1030px;
            height:100%;
            margin-left: 170px;
            padding-left: 52px;
            padding-right: 25px;
            padding-bottom: 50px;
            box-sizing: border-box;
            overflow: hidden;
            .cnt-column-title{
              font: 24px/24px MicrosoftYaHei;
              color: #2e2e2e;   
              text-align:center;
              margin-bottom: 32px;
            }
            .cnt-column-text{
             color: #757575;
             section{
                 margin-bottom: 25px;
              }
             h3{
                font: 14px/14px MicrosoftYaHei!important;  
             }
             p+p{margin-top: 20px;}
             span{display:block;text-indent: 30px;}
             .active-index{text-indent:0;padding-left: 30px;} 
             .activeClick{
                color: #3f8def;
                cursor: pointer;
                &:hover{
                   text-decoration: underline; 
                }
             }
            }
            .cnt-column-text-Two{
              .active{line-height: 25px;}
              .cnt-column-text-border{
                    border-bottom: 1px solid #e2e2e2;
                    padding-bottom: 15px;
                    margin-bottom: 10px;
                 .column-Two-text{
                    font: 16px/16px MicrosoftYaHei;
                    color: #2e2e2e;
                    margin-bottom: 10px;  
                 }
              }
              .column-text-table{
                    margin-top: 30px;
                 table {
                    border-collapse: collapse;
                    td, th{width: 135px;height:30px;text-align: center;line-height: 30px;}
                    }
                table, td, th {
                    border: 1px solid black;
                }
              }
              .column-text-Remarks{
                  margin-top: 80px;
                  span{text-indent: 0;}
                }
            }
          }
        }
    }
</style>
