<template>
    <section>
        <div class="header-main">
            <div class="header-box-search">
                <div class="search-box">
                    <div class="search-icon"><img src="" alt=""></div>
                    <div class="search-ipt"><input type="text"><button>搜索</button></div>
                    <div class="search-down">
                        <span>1</span>
                        <span>2</span>
                    </div>
                </div>
            </div>
            <div class="header-box-banner">
                
            </div>
            <div class="header-box-nav">
                <p class="nav-list">
                    <span class="active">
                        <svg class="icon" style="width: 1em; height: 1em;vertical-align: middle;fill: currentColor;overflow: hidden;font-size: 21px;vertical-align: text-bottom;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1514"><path d="M545.036 146.168c-1.354-1.868-13.784-12.74-19.07-14.751-0.715-0.282-5.245-1.675-6.852-1.985-1.22-0.233-6.175-0.707-7.454-0.707-1.239 0-6.232 0.474-7.434 0.707-1.586 0.31-6.156 1.703-6.853 1.985-5.303 2.012-17.733 12.883-19.05 14.75l-371.55 371.577c-15.062 15.052-14.558 39.997 1.163 55.718 15.72 15.71 40.655 16.224 55.718 1.171l9.234-9.226v267.038h0.233c1.219 53.433 44.74 96.44 98.482 96.44h139.582c20.598 0 37.325-15.76 39.262-35.835h0.387V730.643h118.751v158.593c0 21.896 17.752 39.65 39.65 39.65h145.894c50.799 0 91.996-41.188 91.996-91.987 0-0.388-0.097-0.755-0.115-1.143h0.115V562.089l12.544 12.545c15.063 15.052 39.998 14.54 55.718-1.171 15.719-15.72 16.262-40.666 1.2-55.718L545.035 146.168z m103.844 703.42v-162.62h-0.426c-1.974-19.361-17.732-34.508-37.362-35.438v-0.184H411.184c-21.372 0-38.66 16.94-39.493 38.1h-0.155v160.141h-99.933l-1.743 0.01c-7.957-0.154-14.675-5.005-17.637-11.896l-0.038-7.521V486.11l259.474-259.495L767.206 482.17v102.374l0.193 161.623c-0.057-0.01-0.115-0.038-0.193-0.047v87.94c-1.859 8.344-8.595 14.664-17.308 15.323h-85.512c0.02 0.07 0.04 0.137 0.04 0.203H648.88z" fill="#BF2071" p-id="1515"></path></svg>
                        首页
                    </span>
                    <span>
                         <svg class="icon" style="width: 1em; height: 1em;vertical-align: middle;fill: currentColor;overflow: hidden;font-size: 21px;vertical-align: text-bottom;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1514"><path d="M545.036 146.168c-1.354-1.868-13.784-12.74-19.07-14.751-0.715-0.282-5.245-1.675-6.852-1.985-1.22-0.233-6.175-0.707-7.454-0.707-1.239 0-6.232 0.474-7.434 0.707-1.586 0.31-6.156 1.703-6.853 1.985-5.303 2.012-17.733 12.883-19.05 14.75l-371.55 371.577c-15.062 15.052-14.558 39.997 1.163 55.718 15.72 15.71 40.655 16.224 55.718 1.171l9.234-9.226v267.038h0.233c1.219 53.433 44.74 96.44 98.482 96.44h139.582c20.598 0 37.325-15.76 39.262-35.835h0.387V730.643h118.751v158.593c0 21.896 17.752 39.65 39.65 39.65h145.894c50.799 0 91.996-41.188 91.996-91.987 0-0.388-0.097-0.755-0.115-1.143h0.115V562.089l12.544 12.545c15.063 15.052 39.998 14.54 55.718-1.171 15.719-15.72 16.262-40.666 1.2-55.718L545.035 146.168z m103.844 703.42v-162.62h-0.426c-1.974-19.361-17.732-34.508-37.362-35.438v-0.184H411.184c-21.372 0-38.66 16.94-39.493 38.1h-0.155v160.141h-99.933l-1.743 0.01c-7.957-0.154-14.675-5.005-17.637-11.896l-0.038-7.521V486.11l259.474-259.495L767.206 482.17v102.374l0.193 161.623c-0.057-0.01-0.115-0.038-0.193-0.047v87.94c-1.859 8.344-8.595 14.664-17.308 15.323h-85.512c0.02 0.07 0.04 0.137 0.04 0.203H648.88z" fill="#BF2071" p-id="1515"></path></svg>
                        首页1
                    </span>
                    <span>
                         <svg class="icon" style="width: 1em; height: 1em;vertical-align: middle;fill: currentColor;overflow: hidden;font-size: 21px;vertical-align: text-bottom;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1514"><path d="M545.036 146.168c-1.354-1.868-13.784-12.74-19.07-14.751-0.715-0.282-5.245-1.675-6.852-1.985-1.22-0.233-6.175-0.707-7.454-0.707-1.239 0-6.232 0.474-7.434 0.707-1.586 0.31-6.156 1.703-6.853 1.985-5.303 2.012-17.733 12.883-19.05 14.75l-371.55 371.577c-15.062 15.052-14.558 39.997 1.163 55.718 15.72 15.71 40.655 16.224 55.718 1.171l9.234-9.226v267.038h0.233c1.219 53.433 44.74 96.44 98.482 96.44h139.582c20.598 0 37.325-15.76 39.262-35.835h0.387V730.643h118.751v158.593c0 21.896 17.752 39.65 39.65 39.65h145.894c50.799 0 91.996-41.188 91.996-91.987 0-0.388-0.097-0.755-0.115-1.143h0.115V562.089l12.544 12.545c15.063 15.052 39.998 14.54 55.718-1.171 15.719-15.72 16.262-40.666 1.2-55.718L545.035 146.168z m103.844 703.42v-162.62h-0.426c-1.974-19.361-17.732-34.508-37.362-35.438v-0.184H411.184c-21.372 0-38.66 16.94-39.493 38.1h-0.155v160.141h-99.933l-1.743 0.01c-7.957-0.154-14.675-5.005-17.637-11.896l-0.038-7.521V486.11l259.474-259.495L767.206 482.17v102.374l0.193 161.623c-0.057-0.01-0.115-0.038-0.193-0.047v87.94c-1.859 8.344-8.595 14.664-17.308 15.323h-85.512c0.02 0.07 0.04 0.137 0.04 0.203H648.88z" fill="#BF2071" p-id="1515"></path></svg>
                        首页2
                    </span>
                    <span>
                         <svg class="icon" style="width: 1em; height: 1em;vertical-align: middle;fill: currentColor;overflow: hidden;font-size: 21px;vertical-align: text-bottom;" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="1514"><path d="M545.036 146.168c-1.354-1.868-13.784-12.74-19.07-14.751-0.715-0.282-5.245-1.675-6.852-1.985-1.22-0.233-6.175-0.707-7.454-0.707-1.239 0-6.232 0.474-7.434 0.707-1.586 0.31-6.156 1.703-6.853 1.985-5.303 2.012-17.733 12.883-19.05 14.75l-371.55 371.577c-15.062 15.052-14.558 39.997 1.163 55.718 15.72 15.71 40.655 16.224 55.718 1.171l9.234-9.226v267.038h0.233c1.219 53.433 44.74 96.44 98.482 96.44h139.582c20.598 0 37.325-15.76 39.262-35.835h0.387V730.643h118.751v158.593c0 21.896 17.752 39.65 39.65 39.65h145.894c50.799 0 91.996-41.188 91.996-91.987 0-0.388-0.097-0.755-0.115-1.143h0.115V562.089l12.544 12.545c15.063 15.052 39.998 14.54 55.718-1.171 15.719-15.72 16.262-40.666 1.2-55.718L545.035 146.168z m103.844 703.42v-162.62h-0.426c-1.974-19.361-17.732-34.508-37.362-35.438v-0.184H411.184c-21.372 0-38.66 16.94-39.493 38.1h-0.155v160.141h-99.933l-1.743 0.01c-7.957-0.154-14.675-5.005-17.637-11.896l-0.038-7.521V486.11l259.474-259.495L767.206 482.17v102.374l0.193 161.623c-0.057-0.01-0.115-0.038-0.193-0.047v87.94c-1.859 8.344-8.595 14.664-17.308 15.323h-85.512c0.02 0.07 0.04 0.137 0.04 0.203H648.88z" fill="#BF2071" p-id="1515"></path></svg>
                        首页3
                    </span>
                    <span>
                        首页4
                    </span>
                    <span>
                        首页5
                    </span>
                    <span>
                        首页6
                    </span>
                    <span>
                        首页7
                    </span>
                </p>
            </div>
        </div>
    </section>
</template>

<script>
export default {
    data() {
        return {

        }
    },
    methods:{

    },
    mounted() {
        
    },
}
</script>

<style lang="scss" scoped>
    .header-main{
        width: 100%;
        height: 100%;
        border-top:1px solid #ebebeb;
        .search-box,.nav-list{
                width: 1200px;
                height:45px;
                margin: auto;
        }
        .header-box-search{
            width: 100%;
            height: 45px;
            box-sizing: border-box;
            .search-box{
                display:flex;
                justify-content:space-around;
                align-items:center;
            }
        }
        .search-box{
            div{display: inline-block;}
            .search-ipt{
                width: 365px;
                input{
                    border: 1px solid #e5e5e5;
                    border-right: none;
                    padding: 8px 10px;
                    height: 32px;
                    line-height: 14px;
                    border-radius: 3px 0 0 3px;
                    width: 310px;
                    vertical-align: top;
                    color: #999;
                    box-sizing: border-box;
                }
                button{
                    width: 50px;
                    height:32px;
                    color: #fff;
                    background-color: #409eff;
                    border: none;
                    line-height: 32px;
                    font-size: 14px;
                    vertical-align: top;
                    border-radius: 0 3px 3px 0;
                    padding: 0;
                    cursor: pointer;
                    position: relative;
                }
            }
        }
        .header-box-banner{
            width: 100%;
            height: 300px;
            background: #ddd;
            box-sizing: border-box;
            position: relative;
            background: darkgray
        }
        .header-box-nav{
            width: 100%;
            height:45px;
            line-height:45px;
            -webkit-box-shadow: 0 2px 9px 0 hsla(0, 0%, 88%, 0.3);
            box-shadow: 0 2px 9px 0 hsla(0, 0%, 88%, 0.3);
            .nav-list{
                text-align: left;
                font-size: 15px;
                span{
                    display: inline-block;
                    padding: 0 15px;
                    cursor: pointer;
                }
                span.active{
                    border-bottom: 2px solid red
                }
            }
        }
    }
</style>


